# KilonewtonMetersPerDegreePerMeter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KilonewtonMetersPerDegreePerMeter Property
UnitTypeId Class See Also
---
Kilonewton meters per degree per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KilonewtonMetersPerDegreePerMeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KilonewtonMetersPerDegreePerMeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KilonewtonMetersPerDegreePerMeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace